tangyangguang/Esp32Base/src/web/internal/WebStatus.cpp
enum class RunningImageSizeState : uint8_t {
    Unread,
    Available,
    Unavailable
};

RunningImageSizeState g_runningImageSizeState = RunningImageSizeState::Unread;
uint32_t g_runningImageSizeBytes = 0;

bool runningImageSize(uint32_t& out) {
    if (g_runningImageSizeState == RunningImageSizeState::Unread) {
        const esp_partition_t* running = esp_ota_get_running_partition();
        if (running) {
            const esp_partition_pos_t position = {
                .offset = running->address,
                .size = running->size,
            };
            esp_image_metadata_t metadata = {};
            if (esp_image_get_metadata(&position, &metadata) == ESP_OK &&
                metadata.image_len > 0 && metadata.image_len <= running->size) {
                g_runningImageSizeBytes = metadata.image_len;
                g_runningImageSizeState = RunningImageSizeState::Available;
            } else {
                g_runningImageSizeState = RunningImageSizeState::Unavailable;
            }
        } else {
            g_runningImageSizeState = RunningImageSizeState::Unavailable;
        }
    }
    out = g_runningImageSizeBytes;
    return g_runningImageSizeState == RunningImageSizeState::Available;
}

void sendStatusCardStart(const char* title,
                         Esp32BaseWeb::UiTone tone,
                         const char* state,
                         const char* extraClass = nullptr) {
    sendChunk("<section class='panel statuspage statuscard");
    if (extraClass && extraClass[0]) {
        sendChunk(" ");
        sendEscapedHtmlChunk(extraClass);
    }
    sendChunk("'><div class='statuscardhead'><h2>");
    sendEscapedHtmlChunk(title);
    sendChunk("</h2>");
    sendStatusTag(tone, state);
    sendChunk("</div><div class='tablewrap'><table class='kv'>");
}

bool resetReasonNeedsAttention() {
    switch (esp_reset_reason()) {
        case ESP_RST_PANIC:
        case ESP_RST_INT_WDT:
        case ESP_RST_TASK_WDT:
        case ESP_RST_WDT:
        case ESP_RST_BROWNOUT:
            return true;
        default:
            return false;
    }
}

#if ESP32BASE_ENABLE_OTA
const char* otaStatusName(Esp32BaseOta::Status status) {
    switch (status) {
        case Esp32BaseOta::IDLE: return "idle";
        case Esp32BaseOta::READY: return "ready";
        case Esp32BaseOta::UPLOADING: return "uploading";
        case Esp32BaseOta::VERIFYING: return "verifying";
        case Esp32BaseOta::SUCCESS: return "success";
        case Esp32BaseOta::FAILED: return "failed";
        default: return "unknown";
    }
}
#endif

void formatIpAddress(const IPAddress& address, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    snprintf(out, len, "%u.%u.%u.%u",
             static_cast<unsigned>(address[0]),
             static_cast<unsigned>(address[1]),
             static_cast<unsigned>(address[2]),
             static_cast<unsigned>(address[3]));
}

void sendPartitionTable() {
    const esp_partition_t* running = esp_ota_get_running_partition();
    const esp_partition_t* boot = esp_ota_get_boot_partition();
    const esp_partition_t* nextOta = esp_ota_get_next_update_partition(nullptr);
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, nullptr);
    sendChunk("<section class='panel statuspage'><h2>Partition Table</h2><div class='tablewrap'><table class='part'><tr><th>Name</th><th>Type</th><th>SubType</th><th>Offset</th><th>Size</th><th>Role</th></tr>");
    while (it) {
        const esp_partition_t* p = esp_partition_get(it);
        if (p) {
            char offset[16];
            char sizeBuf[48];
            snprintf(offset, sizeof(offset), "0x%06lx", static_cast<unsigned long>(p->address));
            formatReadableBytes(p->size, sizeBuf, sizeof(sizeBuf));
            sendChunk("<tr><td>");
            sendEscapedHtmlChunk(p->label);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(partitionTypeName(p->type));
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(partitionSubtypeName(p));
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(offset);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(sizeBuf);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(partitionRole(p, running, boot, nextOta));
            sendChunk("</td></tr>");
        }
        it = esp_partition_next(it);
    }
    esp_partition_iterator_release(it);
    sendChunk("</table></div></section>");
}

void sendFirmwareOtaDetails() {
    char runningElfSha[65] = "";
    esp_ota_get_app_elf_sha256(runningElfSha, sizeof(runningElfSha));
    sendInfoRow("Running ELF SHA256", runningElfSha[0] ? runningElfSha : "unavailable");
}

void handleStatus() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    if (!beginResponse(200, "application/json", nullptr)) {
        return;
    }
    sendChunk("{\"firmware\":{\"name\":\"");
    sendEscapedJsonChunk(Esp32Base::firmwareName());
    sendChunk("\",\"version\":\"");
    sendEscapedJsonChunk(Esp32Base::firmwareVersion());
    sendChunk("\",\"build\":\"");
    sendEscapedJsonChunk(Esp32Base::firmwareBuild());
    sendChunk("\",\"imageSize\":");
    uint32_t imageSize = 0;
    if (runningImageSize(imageSize)) {
        sendBytesJsonChunk(imageSize);
    } else {
        sendChunk("null");
    }
    sendChunk("},\"profile\":\"");
    sendEscapedJsonChunk(Esp32Base::profileName());
    sendChunk("\",\"hostname\":\"");
    sendEscapedJsonChunk(Esp32Base::hostname());
    sendChunk("\",\"uptimeMs\":");
    sendUintChunk(Esp32BaseSystem::uptimeMs64());
    sendChunk("\",\"heap\":{\"free\":");
    sendBytesJsonChunk(Esp32BaseSystem::freeHeap());
    sendChunk(",\"minFree\":");
    sendBytesJsonChunk(Esp32BaseSystem::minFreeHeap());
    sendChunk("},\"flash\":");
    sendBytesJsonChunk(Esp32BaseSystem::flashSize());
    sendChunk(",\"resetReason\":\"");
    sendEscapedJsonChunk(Esp32BaseSystem::resetReason());
    sendChunk("\",\"resetReasonText\":\"");
    sendEscapedJsonChunk(Esp32BaseSystem::resetReasonText());
    sendChunk("\",\"wakeReason\":\"");
    sendEscapedJsonChunk(Esp32BaseSystem::wakeReason());
    sendChunk("\",\"wakeReasonText\":\"");
    sendEscapedJsonChunk(Esp32BaseSystem::wakeReasonText());
    sendChunk("\"");
    sendChunk(",\"wifi\":{\"state\":\"");
    sendEscapedJsonChunk(Esp32BaseWiFi::stateName());
    sendChunk("\",\"connected\":");
    sendChunk(Esp32BaseWiFi::isConnected() ? "true" : "false");
    sendChunk(",\"rssi\":");
    sendIntChunk(Esp32BaseWiFi::isConnected() ? Esp32BaseWiFi::rssi() : 0);
    sendChunk("}}");
    endResponse();
}

void handleChip() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    if (!beginResponse(200, "application/json", nullptr)) {
        return;
    }
    char mac[18];
    formatMac(ESP.getEfuseMac(), mac, sizeof(mac));
    sendChunk("{\"chipModel\":\"");
    sendEscapedJsonChunk(ESP.getChipModel());
    sendChunk("\",\"chipRevision\":");
    sendIntChunk(ESP.getChipRevision());
    sendChunk(",\"cpuMHz\":");
    sendIntChunk(ESP.getCpuFreqMHz());
    sendChunk(",\"sdkVersion\":\"");
    sendEscapedJsonChunk(ESP.getSdkVersion());
    sendChunk("\",\"efuseMac\":\"");
    sendEscapedJsonChunk(mac);
    sendChunk("\",\"staMac\":\"");
    sendEscapedJsonChunk(WiFi.macAddress().c_str());
    sendChunk("\",\"apMac\":\"");
    sendEscapedJsonChunk(WiFi.softAPmacAddress().c_str());
    sendChunk("\",\"freeHeap\":");
    sendBytesJsonChunk(Esp32BaseSystem::freeHeap());
    sendChunk(",\"minFreeHeap\":");
    sendBytesJsonChunk(Esp32BaseSystem::minFreeHeap());
    sendChunk(",\"totalHeap\":");
    sendBytesJsonChunk(Esp32BaseSystem::totalHeap());
    sendChunk(",\"psram\":{\"total\":");
    sendBytesJsonChunk(ESP.getPsramSize());
    sendChunk(",\"free\":");
    sendBytesJsonChunk(ESP.getFreePsram());
    sendChunk("}");
    sendChunk(",\"flash\":");
    sendBytesJsonChunk(Esp32BaseSystem::flashSize());
    sendChunk(",\"resetReason\":\"");
    sendEscapedJsonChunk(Esp32BaseSystem::resetReason());
    sendChunk("\",\"resetReasonText\":\"");
    sendEscapedJsonChunk(Esp32BaseSystem::resetReasonText());
    sendChunk("\",\"wakeReason\":\"");
    sendEscapedJsonChunk(Esp32BaseSystem::wakeReason());
    sendChunk("\",\"wakeReasonText\":\"");
    sendEscapedJsonChunk(Esp32BaseSystem::wakeReasonText());
    sendChunk("\"}");
    endResponse();
}

void handleFirmware() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    if (!beginResponse(200, "application/json", nullptr)) {
        return;
    }
    sendChunk("{\"name\":\"");
    sendEscapedJsonChunk(Esp32Base::firmwareName());
    sendChunk("\",\"version\":\"");
    sendEscapedJsonChunk(Esp32Base::firmwareVersion());
    sendChunk("\",\"build\":\"");
    sendEscapedJsonChunk(Esp32Base::firmwareBuild());
    sendChunk("\",\"imageSize\":");
    uint32_t imageSize = 0;
    if (runningImageSize(imageSize)) {
        sendBytesJsonChunk(imageSize);
    } else {
        sendChunk("null");
    }
    sendChunk("}");
    endResponse();
}

bool loadStoredHostname(char* out, size_t len) {
    if (!out || len == 0) {
        return false;
    }
    out[0] = '\0';
    return Esp32BaseConfig::getStr("eb_sys", "hostname", out, len, "");
}

bool hostnameRestartRequired(const char* storedHostname) {
    return storedHostname && storedHostname[0] &&
           Esp32Base::isValidHostname(storedHostname) &&
           strcmp(storedHostname, Esp32Base::hostname()) != 0;
}

