tangyangguang/Esp32Base/src/web/internal/WebStatus.cpp
void sendHostnameJson(int code) {
    char stored[64] = "";
    const bool hasStored = loadStoredHostname(stored, sizeof(stored));
    const bool storedValid = hasStored && Esp32Base::isValidHostname(stored);
    if (!beginResponse(code, "application/json", nullptr)) {
        return;
    }
    sendChunk("{\"currentHostname\":\"");
    sendEscapedJsonChunk(Esp32Base::hostname());
    sendChunk("\",\"defaultHostname\":\"");
    sendEscapedJsonChunk(Esp32Base::defaultHostname());
    sendChunk("\",\"storedHostname\":\"");
    sendEscapedJsonChunk(hasStored ? stored : "");
    sendChunk("\",\"storedValid\":");
    sendChunk(storedValid ? "true" : "false");
    sendChunk(",\"restartRequired\":");
    sendChunk(hostnameRestartRequired(stored) ? "true" : "false");
    sendChunk(",\"rule\":\"1-32 lowercase letters, digits and hyphen; no leading/trailing hyphen; no .local\"}");
    endResponse();
}

void handleHostnameApiGet() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    sendHostnameJson(200);
}

void handleHostnameSubmit() {
    markRequest();
    if (!ensurePostAllowed("hostname_submit")) {
        return;
    }
    const String hostname = g_server.arg("hostname");
    const String uri = g_server.uri();
    const bool apiRequest = strcmp(uri.c_str(), "/esp32base/api/hostname") == 0;
    if (!Esp32Base::isValidHostname(hostname.c_str())) {
        ESP32BASE_LOG_W("web", "hostname_save_rejected value=%s", hostname.c_str());
        if (apiRequest) {
            sendHostnameJson(400);
        } else {
            redirectSeeOther("/esp32base/system?hostname_error=invalid");
        }
        return;
    }
    const bool ok = Esp32BaseConfig::setStr("eb_sys", "hostname", hostname.c_str());
    ESP32BASE_LOG_I("web", "hostname_save value=%s current=%s restart_required=%s result=%s",
                    hostname.c_str(),
                    Esp32Base::hostname(),
                    strcmp(hostname.c_str(), Esp32Base::hostname()) != 0 ? "yes" : "no",
                    ok ? "success" : "failed");
    if (apiRequest) {
        sendHostnameJson(ok ? 200 : 500);
    } else {
        redirectSeeOther(ok ? "/esp32base/system?hostname_saved=1" : "/esp32base/system?hostname_error=save_failed");
    }
}

void handleStatusPage() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    Esp32BaseWeb::sendHeader(g_builtinLabels[Esp32BaseWeb::BUILTIN_HOME]);
    Esp32BaseWeb::sendPageTitle(g_deviceName, "Operational status and low-cost diagnostics");

    char value[160] = "";
    char uptime[32] = "";
    char freeHeap[48] = "";
    char minHeap[48] = "";
    char maxAllocHeap[48] = "";
    char totalHeap[48] = "";
    char imageSizeText[48] = "unavailable";
    char otaTargetSize[48] = "unavailable";
    char runningSlot[80] = "unknown";
    char bootSlot[80] = "unknown";
    char otaTargetSlot[80] = "unavailable";
    char flash[48] = "";
    const bool details = statusDetailsMode();
    Esp32BaseLog::formatUptime64(Esp32BaseSystem::uptimeMs64(), uptime, sizeof(uptime));
    formatReadableBytes(Esp32BaseSystem::freeHeap(), freeHeap, sizeof(freeHeap));
    formatReadableBytes(Esp32BaseSystem::minFreeHeap(), minHeap, sizeof(minHeap));
    formatReadableBytes(ESP.getMaxAllocHeap(), maxAllocHeap, sizeof(maxAllocHeap));
    formatReadableBytes(Esp32BaseSystem::totalHeap(), totalHeap, sizeof(totalHeap));
    formatReadableBytes(Esp32BaseSystem::flashSize(), flash, sizeof(flash));
    uint32_t imageSize = 0;
    const bool hasImageSize = runningImageSize(imageSize);
    if (hasImageSize) {
        formatReadableBytes(imageSize, imageSizeText, sizeof(imageSizeText));
    }
    const esp_partition_t* runningPartition = esp_ota_get_running_partition();
    const esp_partition_t* bootPartition = esp_ota_get_boot_partition();
    const esp_partition_t* nextPartition = esp_ota_get_next_update_partition(nullptr);
    if (runningPartition) {
        char runningSize[48];
        formatReadableBytes(runningPartition->size, runningSize, sizeof(runningSize));
        snprintf(runningSlot, sizeof(runningSlot), "%s / %s", runningPartition->label, runningSize);
    }
    if (bootPartition) {
        char bootSize[48];
        formatReadableBytes(bootPartition->size, bootSize, sizeof(bootSize));
        snprintf(bootSlot, sizeof(bootSlot), "%s / %s", bootPartition->label, bootSize);
    }
    if (nextPartition) {
        formatReadableBytes(nextPartition->size, otaTargetSize, sizeof(otaTargetSize));
        snprintf(otaTargetSlot, sizeof(otaTargetSlot), "%s / %s", nextPartition->label, otaTargetSize);
    }
#if ESP32BASE_ENABLE_WIFI
    const bool wifiConnected = Esp32BaseWiFi::isConnected();
    const bool wifiWarn = Esp32BaseWiFi::safeBootPaused() || Esp32BaseWiFi::state() == Esp32BaseWiFi::FAILED;
    char wifiIp[24] = "-";
    if (wifiConnected) {
        Esp32BaseWiFi::ip(wifiIp, sizeof(wifiIp));
    }
#endif

    sendChunk("<section class='panel statusidentity'><div class='metrics'>");
    sendChunk("<div><b>Firmware</b><span>");
    sendEscapedHtmlChunk(Esp32Base::firmwareName());
    sendChunk(" ");
    sendEscapedHtmlChunk(Esp32Base::firmwareVersion());
    sendChunk("</span></div><div><b>Hostname</b><span>");
    sendEscapedHtmlChunk(Esp32Base::hostname());
    sendChunk("</span></div><div><b>Profile</b><span>");
    sendEscapedHtmlChunk(Esp32Base::profileName());
    sendChunk("</span></div><div><b>Uptime</b><span>");
    sendEscapedHtmlChunk(uptime);
    sendChunk("</span></div></div><p class='statusmeta'>Boot count ");
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(Esp32BaseSystem::bootCount()));
    sendEscapedHtmlChunk(value);
    if (Esp32Base::firmwareBuild()[0]) {
        sendChunk(" · Build ");
        sendEscapedHtmlChunk(Esp32Base::firmwareBuild());
    }
    sendChunk("</p>");
#if ESP32BASE_ENABLE_WIFI
    sendChunk("<div class='statusnetworkquick'><div class='statusnetworkcopy'><b>Network setup</b><span>");
    if (wifiConnected && Esp32BaseWiFi::ssid()[0]) {
        sendEscapedHtmlChunk(Esp32BaseWiFi::ssid());
        sendChunk(" · ");
        sendEscapedHtmlChunk(wifiIp);
    } else if (Esp32BaseWiFi::state() == Esp32BaseWiFi::CONFIG_PORTAL) {
        sendChunk("Configuration hotspot is active");
    } else {
        sendChunk("Choose or update the device WiFi network");
    }
    sendChunk("</span></div><a class='btnlink info statuswifibutton' href='/esp32base/wifi'>Configure WiFi</a></div>");
#endif
    sendChunk("</section>");

    const bool configStalled = Esp32BaseConfig::isDeferredFlushPaused() && Esp32BaseConfig::pendingCount() > 0;
    bool hasAttention = resetReasonNeedsAttention() || configStalled || Esp32Base::lastError()[0];
#if ESP32BASE_ENABLE_WIFI
    hasAttention = hasAttention || Esp32BaseWiFi::safeBootPaused() || Esp32BaseWiFi::state() == Esp32BaseWiFi::FAILED;
#endif
#if ESP32BASE_ENABLE_FS
    hasAttention = hasAttention || !Esp32BaseFs::isReady();
#endif
#if ESP32BASE_ENABLE_FILELOG
    hasAttention = hasAttention || Esp32BaseFileLog::faulted();
#endif
#if ESP32BASE_ENABLE_OTA
    hasAttention = hasAttention || Esp32BaseOta::status() == Esp32BaseOta::FAILED || Esp32BaseOta::waitingForMarkValid();
#endif
    if (hasAttention) {
        sendChunk("<section class='panel statusattention'><h2>Attention</h2><ul class='statusissues'>");
        if (resetReasonNeedsAttention()) {
            sendChunk("<li>Previous reset: "); sendEscapedHtmlChunk(Esp32BaseSystem::resetReason()); sendChunk("</li>");
        }
        if (Esp32Base::lastError()[0]) {
            sendChunk("<li>Startup error: "); sendEscapedHtmlChunk(Esp32Base::lastError()); sendChunk("</li>");
        }
        if (configStalled) sendChunk("<li>Deferred configuration writes are paused.</li>");
#if ESP32BASE_ENABLE_WIFI
        if (Esp32BaseWiFi::safeBootPaused()) sendChunk("<li>Saved WiFi recovery is paused by the guarded-reset policy.</li>");
        if (Esp32BaseWiFi::state() == Esp32BaseWiFi::FAILED) sendChunk("<li>WiFi connection attempts have failed.</li>");
#endif
#if ESP32BASE_ENABLE_FS
        if (!Esp32BaseFs::isReady()) sendChunk("<li>File system is unavailable.</li>");
#endif
#if ESP32BASE_ENABLE_FILELOG
        if (Esp32BaseFileLog::faulted()) sendChunk("<li>System file logging is faulted.</li>");
#endif
#if ESP32BASE_ENABLE_OTA
        if (Esp32BaseOta::status() == Esp32BaseOta::FAILED) sendChunk("<li>The last OTA operation failed.</li>");
        if (Esp32BaseOta::waitingForMarkValid()) sendChunk("<li>The running OTA image is waiting to be marked valid.</li>");
#endif
        sendChunk("</ul></section>");
    }

    sendChunk("<div class='statusgrid'>");

