tangyangguang/Esp32Base/src/web/internal/WebStatus.cpp
#if ESP32BASE_ENABLE_WIFI
    sendStatusCardStart("Network", wifiWarn ? Esp32BaseWeb::UI_WARN : (wifiConnected ? Esp32BaseWeb::UI_OK : Esp32BaseWeb::UI_NEUTRAL), Esp32BaseWiFi::stateName());
    sendInfoRowStart("WiFi");
    if (Esp32BaseWiFi::ssid()[0]) {
        sendEscapedHtmlChunk(Esp32BaseWiFi::ssid());
    } else {
        sendChunk("No saved network");
    }
    sendInfoRowEnd();
    sendInfoRow("IP", wifiIp);
    if (wifiConnected) {
        snprintf(value, sizeof(value), "%ld dBm", static_cast<long>(Esp32BaseWiFi::rssi()));
    } else {
        strlcpy(value, "-", sizeof(value));
    }
    sendInfoRow("RSSI", value);
    sendInfoRowStart("Retry");
    sendSubmetricsStart();
    snprintf(value, sizeof(value), "%u", static_cast<unsigned>(Esp32BaseWiFi::retryCount()));
    sendSubmetric("Attempts", value);
    snprintf(value, sizeof(value), "%lu ms", static_cast<unsigned long>(Esp32BaseWiFi::retryRemainingMs()));
    sendSubmetric("Next", value);
    sendSubmetricsEnd();
    sendInfoRowEnd();
    sendTaggedInfoRow("Recovery policy", Esp32BaseWiFi::safeBootPaused() ? "paused" : "available", Esp32BaseWiFi::safeBootPaused() ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK);
    sendInfoRow("Power save", Esp32BaseWiFi::powerSave() ? "on" : "off");
#if ESP32BASE_ENABLE_MDNS
    sendTaggedInfoRow("mDNS", Esp32BaseMdns::isRunning() ? "running" : "stopped", Esp32BaseMdns::isRunning() ? Esp32BaseWeb::UI_OK : Esp32BaseWeb::UI_NEUTRAL);
#endif
    if (details) {
        char address[24];
        formatIpAddress(WiFi.gatewayIP(), address, sizeof(address)); sendInfoRow("Gateway", address);
        formatIpAddress(WiFi.subnetMask(), address, sizeof(address)); sendInfoRow("Subnet", address);
        formatIpAddress(WiFi.dnsIP(), address, sizeof(address)); sendInfoRow("DNS", address);
        snprintf(value, sizeof(value), "%d", WiFi.channel()); sendInfoRow("Channel", value);
        sendInfoRow("STA MAC", WiFi.macAddress().c_str());
        sendInfoRow("AP MAC", WiFi.softAPmacAddress().c_str());
    }
    sendStatusSectionEnd();
#endif

    sendStatusCardStart("Runtime",
                        resetReasonNeedsAttention() ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK,
                        resetReasonNeedsAttention() ? "check reset" : "healthy",
                        "statusruntime");
    sendInfoRowStart("Heap");
    sendSubmetricsStart();
    sendSubmetric("Free", freeHeap);
    sendSubmetric("Min", minHeap);
    sendSubmetric("Max alloc", maxAllocHeap);
    sendSubmetric("Total", totalHeap);
    sendSubmetricsEnd();
    sendInfoRowEnd();
    const uint32_t stackFreeBytes = static_cast<uint32_t>(uxTaskGetStackHighWaterMark(nullptr)) * sizeof(StackType_t);
    formatReadableBytes(stackFreeBytes, value, sizeof(value));
    sendInfoRow("Loop stack low-water", value);
#if ESP32BASE_ENABLE_HEALTH
    sendInfoRowStart("Loop health");
    sendSubmetricsStart();
    snprintf(value, sizeof(value), "%lu ms", static_cast<unsigned long>(Esp32BaseHealth::loopPeriodMaxMs()));
    sendSubmetric("Max period", value);
    const uint32_t healthAge = millis() - Esp32BaseHealth::lastTickMs();
    snprintf(value, sizeof(value), "%lu ms", static_cast<unsigned long>(healthAge));
    sendSubmetric("Tick age", value);
    sendSubmetricsEnd();
    sendInfoRowEnd();
#endif
    if (ESP.getPsramSize() > 0) {
        char psramTotal[48], psramFree[48], psramMin[48], psramMax[48];
        formatReadableBytes(ESP.getPsramSize(), psramTotal, sizeof(psramTotal));
        formatReadableBytes(ESP.getFreePsram(), psramFree, sizeof(psramFree));
        formatReadableBytes(ESP.getMinFreePsram(), psramMin, sizeof(psramMin));
        formatReadableBytes(ESP.getMaxAllocPsram(), psramMax, sizeof(psramMax));
        sendInfoRowStart("PSRAM"); sendSubmetricsStart();
        sendSubmetric("Free", psramFree); sendSubmetric("Min", psramMin); sendSubmetric("Max alloc", psramMax); sendSubmetric("Total", psramTotal);
        sendSubmetricsEnd(); sendInfoRowEnd();
    }
#if ESP32BASE_ENABLE_WATCHDOG
    const WatchdogTripState watchdogTrip = readWatchdogTripState();
    char tripResetAt[32];
    formatWatchdogTripResetAt(watchdogTrip, tripResetAt, sizeof(tripResetAt));
    sendInfoRowStart("Watchdog");
    sendStatusTag(Esp32BaseWeb::UI_OK, "enabled");
    sendSubmetricsStart();
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(watchdogTrip.lifetime));
    sendSubmetric("Lifetime resets", value);
    if (watchdogTrip.invalidBase) {
        strlcpy(value, "invalid baseline", sizeof(value));
    } else {
        snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(watchdogTrip.trip));
    }
    sendSubmetric("Trip resets", value);
    sendSubmetric("Trip reset at", tripResetAt);
    sendSubmetricsEnd();
    sendInfoRowEnd();
#endif
#if ESP32BASE_ENABLE_TIME
    const Esp32BaseTime::Snapshot baseTime = Esp32BaseTime::snapshot();
    sendInfoRowStart("Time");
    if (baseTime.synced) {
        sendStatusTag(Esp32BaseWeb::UI_OK, "synced");
    } else {
        sendStatusTag(Esp32BaseWeb::UI_NEUTRAL, "uptime only");
    }
    sendSubmetricsStart();
    sendSubmetric("Source", Esp32BaseTime::sourceName(baseTime.source));
    if (baseTime.synced && Esp32BaseTime::formatTime(value, sizeof(value), "%Y-%m-%d %H:%M:%S")) {
        sendSubmetric("Current", value);
    }
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(baseTime.uptimeSec));
    sendSubmetric("Uptime sec", value);
    sendSubmetricsEnd();
    sendInfoRowEnd();
#endif
#if ESP32BASE_ENABLE_RTC
    sendInfoRowStart("RTC");
    if (Esp32BaseRtc::status() == Esp32BaseRtc::STATUS_OK) {
        sendStatusTag(Esp32BaseWeb::UI_OK, Esp32BaseRtc::statusText());
    } else if (Esp32BaseRtc::status() == Esp32BaseRtc::STATUS_NOT_STARTED) {
        sendStatusTag(Esp32BaseWeb::UI_NEUTRAL, Esp32BaseRtc::statusText());
    } else {
        sendStatusTag(Esp32BaseWeb::UI_WARN, Esp32BaseRtc::statusText());
    }
    sendSubmetricsStart();
    sendSubmetric("Driver", Esp32BaseRtc::driverName());
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(Esp32BaseRtc::lastEpoch()));
    sendSubmetric("Last epoch", value);
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(Esp32BaseRtc::lastSyncUptimeSec()));
    sendSubmetric("Last sync uptime", value);
    sendSubmetricsEnd();
    sendInfoRowEnd();
#endif
#if ESP32BASE_ENABLE_NTP
    const Esp32BaseNtp::TimeSnapshot ntpTime = Esp32BaseNtp::snapshot();
    sendInfoRowStart("NTP");
    if (!Esp32BaseNtp::isStarted()) {
        sendStatusTag(Esp32BaseWeb::UI_NEUTRAL, "not started");
    } else if (ntpTime.synced) {
        sendStatusTag(Esp32BaseWeb::UI_OK, "synced");
    } else {
        sendStatusTag(Esp32BaseWeb::UI_WARN, "pending");
    }
    if (ntpTime.synced && Esp32BaseNtp::formatTime(value, sizeof(value), "%Y-%m-%d %H:%M:%S")) {
        sendChunk("<br>");
        sendEscapedHtmlChunk(value);
    }
    sendInfoRowEnd();
#endif
    sendInfoRowStart("Last reset");
    sendEscapedHtmlChunk(Esp32BaseSystem::resetReason());
    sendChunk(" / ");
    sendEscapedHtmlChunk(Esp32BaseSystem::resetReasonText());
    sendInfoRowEnd();
    sendInfoRowStart("Last wake");
    sendEscapedHtmlChunk(Esp32BaseSystem::wakeReason());
    sendChunk(" / ");
    sendEscapedHtmlChunk(Esp32BaseSystem::wakeReasonText());
    sendInfoRowEnd();
    sendStatusSectionEnd();

    const uint8_t pendingConfig = Esp32BaseConfig::pendingCount();
    sendStatusCardStart("Persistence", configStalled ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK, configStalled ? "writes paused" : "ready");
    sendInfoRowStart("Configuration");
    sendSubmetricsStart();
    snprintf(value, sizeof(value), "%u / %u", static_cast<unsigned>(pendingConfig), static_cast<unsigned>(Esp32BaseConfig::pendingCapacity()));
    sendSubmetric("Pending", value);
    sendSubmetric("Flush", Esp32BaseConfig::isDeferredFlushPaused() ? "paused" : "running");
    sendSubmetricsEnd();
    sendInfoRowEnd();
#if ESP32BASE_ENABLE_FS
    if (Esp32BaseFs::isReady()) {
        sendFsQuickSummaryRows();
    } else {
        sendTaggedInfoRow("FS", "unavailable", Esp32BaseWeb::UI_WARN);
    }
#endif
#if ESP32BASE_ENABLE_FILELOG
    sendInfoRowStart("System logs");
    sendFileLogRuntimeStateTag();
    if (fileLogHasRuntimeDetails()) {
        char logLimit[48];
        char rotateFiles[12];
        formatReadableBytes(static_cast<uint64_t>(Esp32BaseFileLog::maxBytes()) * Esp32BaseFileLog::rotateFiles(), logLimit, sizeof(logLimit));
        snprintf(rotateFiles, sizeof(rotateFiles), "%u", static_cast<unsigned>(Esp32BaseFileLog::rotateFiles()));
        sendSubmetricsStart();
        sendSubmetric("Log level", Esp32BaseFileLog::modeName());
        sendSubmetric("Files", rotateFiles);
        sendSubmetric("Limit", logLimit);
        sendSubmetricsEnd();
    }
    sendInfoRowEnd();
    if (Esp32BaseFileLog::bufferEnabled()) {
        snprintf(value, sizeof(value), "%u / %u bytes", static_cast<unsigned>(Esp32BaseFileLog::bufferUsed()), static_cast<unsigned>(Esp32BaseFileLog::bufferSize()));
        sendInfoRow("Log buffer", value);
    }
#endif
#if ESP32BASE_ENABLE_APP_EVENTS
    Esp32BaseAppEvents::AppEventsStatus appEventStatus = {};
    if (Esp32BaseAppEvents::readStatus(appEventStatus)) {
        sendInfoRowStart("Application events");
        sendStatusTag(appEventStatus.eventStore.ready ? Esp32BaseWeb::UI_OK : Esp32BaseWeb::UI_WARN,
                      Esp32BaseRecordStore::storeStateName(appEventStatus.eventStore.state));
        sendSubmetricsStart();
        snprintf(value, sizeof(value), "%lu / %lu", static_cast<unsigned long>(appEventStatus.eventStore.recordCount), static_cast<unsigned long>(appEventStatus.eventStore.capacity));
        sendSubmetric("Records", value);
        snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(appEventStatus.eventStore.damagedRecordCount));
        sendSubmetric("Damaged", value);
        sendSubmetricsEnd(); sendInfoRowEnd();
    }
#endif
#if ESP32BASE_ENABLE_RECORD_STORE
    uint32_t businessRecords = 0;
    uint8_t businessFaults = 0;
    const uint8_t storeCount = businessRecordStoreCount();
    for (uint8_t i = 0; i < storeCount; ++i) {
        Esp32BaseRecordStore* store = businessRecordStoreAt(i);
        Esp32BaseRecordStore::StoreStatus storeStatus = {};
        if (!store || !store->readStatus(storeStatus) || !storeStatus.ready || storeStatus.damagedRecordCount > 0) ++businessFaults;
        businessRecords += storeStatus.recordCount;
    }
    if (storeCount > 0) {
        sendInfoRowStart("Business stores");
        sendStatusTag(businessFaults ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK, businessFaults ? "check" : "ready");
        sendSubmetricsStart();
        snprintf(value, sizeof(value), "%u", static_cast<unsigned>(storeCount)); sendSubmetric("Stores", value);
        snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(businessRecords)); sendSubmetric("Records", value);
        snprintf(value, sizeof(value), "%u", static_cast<unsigned>(businessFaults)); sendSubmetric("Faults", value);
        sendSubmetricsEnd(); sendInfoRowEnd();
    }
#endif
    if (details) {
        nvs_stats_t nvsStats = {};
        if (nvs_get_stats(nullptr, &nvsStats) == ESP_OK) {
            sendInfoRowStart("NVS entries"); sendSubmetricsStart();
            snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(nvsStats.used_entries)); sendSubmetric("Used", value);
            snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(nvsStats.free_entries)); sendSubmetric("Free", value);
            snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(nvsStats.total_entries)); sendSubmetric("Total", value);
            snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(nvsStats.namespace_count)); sendSubmetric("Namespaces", value);
            sendSubmetricsEnd(); sendInfoRowEnd();
        }
    }
    sendStatusSectionEnd();

    bool imageFitsTarget = hasImageSize && nextPartition && imageSize <= nextPartition->size;
    Esp32BaseWeb::UiTone firmwareTone = (!hasImageSize || (nextPartition && !imageFitsTarget)) ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK;
    sendStatusCardStart(
#if ESP32BASE_ENABLE_OTA
        "Firmware & OTA",
#else
        "Firmware",
#endif
        firmwareTone, hasImageSize ? "measured" : "size unavailable");
    sendInfoRow("Current image", imageSizeText);
    sendInfoRow("Running slot", runningSlot);
    sendInfoRow("Boot slot", bootSlot);
    sendInfoRow("OTA target slot", otaTargetSlot);
    sendInfoRow("Max OTA upload", otaTargetSize);
    sendInfoRow("Fits OTA target", hasImageSize && nextPartition ? (imageFitsTarget ? "yes" : "no") : "unknown");
#if ESP32BASE_ENABLE_OTA
    sendInfoRow("OTA service", otaStatusName(Esp32BaseOta::status()));
    sendInfoRow("Running image state", Esp32BaseOta::runningOtaState());
    if (Esp32BaseOta::waitingForMarkValid()) {
        sendInfoRowStart("Mark-valid window"); sendSubmetricsStart();
        snprintf(value, sizeof(value), "%lu ms", static_cast<unsigned long>(Esp32BaseOta::markValidElapsedMs())); sendSubmetric("Elapsed", value);
        snprintf(value, sizeof(value), "%lu ms", static_cast<unsigned long>(Esp32BaseOta::markValidTimeoutMs())); sendSubmetric("Timeout", value);
        sendSubmetricsEnd(); sendInfoRowEnd();
    }
    sendInfoRow("Rollback", Esp32BaseOta::isRollbackPossible() ? "possible" : "not possible");
    if (Esp32BaseOta::lastError()[0]) {
        sendInfoRow("Last OTA error", Esp32BaseOta::lastError());
    }
#endif
    if (details) {
        sendFirmwareOtaDetails();
    }
    sendStatusSectionEnd();

    char mac[18];
    sendStatusCardStart("Platform & Security", Esp32BaseWeb::isAuthEnabled() ? Esp32BaseWeb::UI_OK : Esp32BaseWeb::UI_WARN, Esp32BaseWeb::isAuthEnabled() ? "protected" : "auth off");
    sendInfoRow("Chip", ESP.getChipModel());
    snprintf(value, sizeof(value), "%d", ESP.getChipRevision());
    sendInfoRow("Revision", value);
    snprintf(value, sizeof(value), "%u", static_cast<unsigned>(ESP.getChipCores()));
    sendInfoRow("Cores", value);
    snprintf(value, sizeof(value), "%u MHz", static_cast<unsigned>(ESP.getCpuFreqMHz()));
    sendInfoRow("CPU", value);
    sendInfoRow("SDK", ESP.getSdkVersion());
    sendInfoRow("Flash chip", flash);
    sendInfoRow("Flash encryption", esp_flash_encryption_enabled() ? "enabled" : "disabled");
    sendInfoRow("Secure boot", esp_secure_boot_enabled() ? "enabled" : "disabled");
    sendInfoRow("Web authentication", Esp32BaseWeb::isAuthEnabled() ? "enabled" : "disabled");
    if (details) {
        formatMac(ESP.getEfuseMac(), mac, sizeof(mac));
        sendInfoRow("eFuse MAC", mac);
    }
    sendStatusSectionEnd();
    sendChunk("</div>");

    sendChunk("<section class='statusdetailtoggle'><a class='btnlink secondary' href='");
    sendChunk(details ? "/esp32base/status" : "/esp32base/status?details=1");
    sendChunk("'>");
    sendChunk(details ? "Hide low-frequency details" : "Show low-frequency details");
    sendChunk("</a><span>Detailed mode adds one-time partition, NVS and network reads.</span></section>");

    sendChunk("<section class='panel appsection'><h2>System settings</h2><p class='muted'>Open device settings and maintenance even when the footer bar is hidden.</p><div class='actions'><a class='btnlink' href='/esp32base/system'>Open System</a></div></section>");

    if (g_homeMode == Esp32BaseWeb::HOME_ESP32BASE && appNavCount() > 0) {
        sendChunk("<section class='panel appsection'><h2>Application</h2>");
        sendAppLinks(true, nullptr);
        sendChunk("</section>");
    }

    if (details) {
        sendPartitionTable();
    }
    Esp32BaseWeb::sendFooter();
}

} // namespace esp32base_web

#endif
